Repository: lemontree-tech/rubiks_cude_solver
Catalog: lib/l10n/app_*.arb
Languages: de, fr, ja, ko, zh_cn

# appTitle
source: Rubik Solver
de: Rubik's Cube Löser
fr: Solveur de Rubik's Cube
ja: ルービックソルバー
ko: 루빅스 큐브 솔버
zh_cn: 魔方求解器

# appDescription
source: Solve 3x3 Rubik's cubes with step-by-step solutions. Features 2D and 3D cube visualization, manual cube input, and automatic solving algorithms.
de: Lösen Sie 3x3 Rubik's Cubes mit Schritt-für-Schritt-Lösungen. Enthält 2D- und 3D-Würfelvisualisierung, manuelle Würfeleingabe und automatische Lösungsalgorithmen.
fr: Résolvez des cubes de Rubik 3x3 avec des solutions étape par étape. Comprend la visualisation 2D et 3D du cube, la saisie manuelle du cube et les algorithmes de résolution automatique.
ja: ステップバイステップのソリューションで3x3ルービックキューブを解決します。2Dおよび3Dキューブの視覚化、手動キューブ入力、自動解決アルゴリズムを備えています。
zh_cn: 使用分步解决方案解决3x3魔方。具有2D和3D立方体可视化、手动魔方输入和自动求解算法。

source: Ready
de: Bereit
fr: Prêt
ja: 準備完了
ko: 준비됨
zh_cn: 就绪

source: Scrambled
de: Gemischt
fr: Mélangé
ja: スクランブル済み
ko: 섞임
zh_cn: 已打乱

source: Solving...
de: Lösen...
fr: Résolution...
ja: 解決中...
ko: 해결 중...
zh_cn: 求解中...

# movesFound
source: {count} moves found
de: {count} Züge gefunden
fr: {count} mouvements trouvés
ja: {count} 手の解法が見つかりました
ko: {count} 단계 해법을 찾았습니다
zh_cn: 找到 {count} 步解法

# alreadySolved
source: Already solved or no solution found
de: Bereits gelöst oder keine Lösung gefunden
fr: Déjà résolu ou aucune solution trouvée
ja: 既に解決済みまたは解法が見つかりませんでした
ko: 이미 해결되었거나 해법을 찾을 수 없습니다
zh_cn: 已解决或未找到解法

# error
source: Error: {message}
de: Fehler: {message}
fr: Erreur : {message}
ja: エラー：{message}
ko: 오류：{message}
zh_cn: 错误：{message}

source: Solution complete
de: Lösung abgeschlossen
fr: Solution complète
ja: 解法完了
ko: 해법 완료
zh_cn: 解法完成

source: Auto apply stopped
de: Automatische Anwendung gestoppt
fr: Application automatique arrêtée
ja: 自動適用が停止しました
ko: 자동 적용이 중지되었습니다
zh_cn: 自动应用已停止

# stepProgress
source: Step {current} / {total}
de: Schritt {current} / {total}
fr: Étape {current} / {total}
ja: ステップ {current} / {total}
ko: 단계 {current} / {total}
zh_cn: 步骤 {current} / {total}

# autoProgress
source: Auto: {current} / {total}
ja: 自動：{current} / {total}
ko: 자동：{current} / {total}
zh_cn: 自动：{current} / {total}

source: Custom cube loaded
de: Benutzerdefinierter Würfel geladen
fr: Cube personnalisé chargé
ja: カスタムキューブを読み込みました
ko: 사용자 정의 큐브가 로드되었습니다
zh_cn: 自定义魔方已加载

source: Scramble
de: Mischen
fr: Mélanger
ja: スクランブル
ko: 섞기
zh_cn: 打乱

source: Solve
de: Lösen
fr: Résoudre
ja: 解決
ko: 해결
zh_cn: 求解

source: Reset
de: Zurücksetzen
fr: Réinitialiser
ja: リセット
ko: 재설정
zh_cn: 重置

source: Close
de: Schließen
fr: Fermer
ja: 閉じる
ko: 닫기
zh_cn: 关闭

source: Cancel
de: Abbrechen
fr: Annuler
ja: キャンセル
ko: 취소
zh_cn: 取消

# saveAndValidate
source: Save & Validate
de: Speichern und validieren
fr: Enregistrer et valider
ja: 保存して検証
ko: 저장 및 검증
zh_cn: 保存并验证

source: Manual Controls
de: Manuelle Steuerung
fr: Contrôles manuels
ja: 手動制御
ko: 수동 제어
zh_cn: 手动控制

source: Solution
de: Lösung
ja: 解法
ko: 해법
zh_cn: 解法

source: ◀ Undo
de: ◀ Rückgängig
fr: ◀ Annuler
ja: ◀ 元に戻す
ko: ◀ 실행 취소
zh_cn: ◀ 撤销

source: Apply ▶
de: Anwenden ▶
fr: Appliquer ▶
ja: 適用 ▶
ko: 적용 ▶
zh_cn: 应用 ▶

source: ▶ Auto
ja: ▶ 自動
ko: ▶ 자동
zh_cn: ▶ 自动

source: ⏸ Stop
de: ⏸ Stoppen
fr: ⏸ Arrêter
ja: ⏸ 停止
ko: ⏸ 중지
zh_cn: ⏸ 停止

source: Manual Cube Input
de: Manuelle Würfeleingabe
fr: Saisie manuelle du cube
ja: 手動キューブ入力
ko: 수동 큐브 입력
zh_cn: 手动输入魔方

# tapToFocus
source: Tap stickers to focus, select color to change
de: Tippen Sie auf Aufkleber zum Fokussieren, wählen Sie die Farbe zum Ändern
fr: Appuyez sur les autocollants pour vous concentrer, sélectionnez la couleur pour changer
ja: ステッカーをタップしてフォーカス、色を選択して変更
ko: 스티커를 탭하여 포커스하고 색상을 선택하여 변경
zh_cn: 点击贴纸聚焦，选择颜色更改

source: Select Color
de: Farbe auswählen
fr: Sélectionner la couleur
ja: 色を選択
ko: 색상 선택
zh_cn: 选择颜色

# invalidCube
source: Invalid cube configuration. Please check colors.
de: Ungültige Würfelkonfiguration. Bitte überprüfen Sie die Farben.
fr: Configuration de cube invalide. Veuillez vérifier les couleurs.
ja: 無効なキューブ構成です。色を確認してください。
ko: 잘못된 큐브 구성입니다. 색상을 확인하세요.
zh_cn: 无效的魔方配置，请检查颜色。
